xanderhendriks-uts/wsn-contiki/examples/cc26xx/cc26xx-web-demo/mqtt-client.c
  DBG("Pub Handler: topic='%s' (len=%u), sub_str='%s', chunk_len=%u\n", topic, topic_len,
      &topic[topic_index], chunk_len);

  if ((strncmp(topic, sub_topic, topic_index - 1) == 0) && (chunk_len == 1))
  {
      /* If the format != json, ignore */
      if(strncmp(&topic[topic_len - 4], "json", 4) != 0) {
        printf("Incorrect format\n");
      }

      if(strncmp(&topic[topic_index], "leds", 4) == 0) {
        if(chunk[0] == '1') {
          leds_on(LEDS_RED);
        } else if(chunk[0] == '0') {
          leds_off(LEDS_RED);
        }
        return;
      }

#if BOARD_SENSORTAG
      if(strncmp(&topic[topic_index], "buzz", 4) == 0) {
        if(chunk[0] == '1') {
          buzzer_start(1000);
        } else if(chunk[0] == '0') {
          buzzer_stop();
        }
        return;
      }
#endif

#if BOARD_LAUNCHPAD
      if(strncmp(&topic[topic_index], "pump", 4) == 0) {
        if(chunk[0] == '1') {
          relay_on(RELAY_ID_PUMP);
        } else if(chunk[0] == '0') {
          relay_off(RELAY_ID_PUMP);
        }
        return;
      }

      if(strncmp(&topic[topic_index], "light", 4) == 0) {
        if(chunk[0] == '1') {
          relay_on(RELAY_ID_LIGHT);
        } else if(chunk[0] == '0') {
          relay_off(RELAY_ID_LIGHT);
        }
        return;
      }

      if(strncmp(&topic[topic_index], "fan", 3) == 0) {
        if(chunk[0] == '1') {
          relay_on(RELAY_ID_FAN);
        } else if(chunk[0] == '0') {
          relay_off(RELAY_ID_FAN);
        }
        return;
      }

      if(strncmp(&topic[topic_index], "cool", 4) == 0) {
        if(chunk[0] == '1') {
          relay_on(RELAY_ID_COOL);
        } else if(chunk[0] == '0') {
          relay_off(RELAY_ID_COOL);
        }
        return;
      }

      if(strncmp(&topic[topic_index], "heat", 4) == 0) {
        if(chunk[0] == '1') {
          relay_on(RELAY_ID_HEAT);
        } else if(chunk[0] == '0') {
          relay_off(RELAY_ID_HEAT);
        }
        return;
      }

#endif

  }
  else {
    /* If we don't like the packet or length, ignore */
    printf("Incorrect topic or chunk len. Ignored\n");
    return;
  }
}
/*---------------------------------------------------------------------------*/
static void
mqtt_event(struct mqtt_connection *m, mqtt_event_t event, void *data)
{
  switch(event) {
  case MQTT_EVENT_CONNECTED: {
    DBG("APP - Application has a MQTT connection\n");
    timer_set(&connection_life, CONNECTION_STABLE_TIME);
    state = MQTT_CLIENT_STATE_CONNECTED;
    break;
  }
  case MQTT_EVENT_DISCONNECTED: {
    DBG("APP - MQTT Disconnect. Reason %u\n", *((mqtt_event_t *)data));

    /* Do nothing if the disconnect was the result of an incoming config */
    if(state != MQTT_CLIENT_STATE_NEWCONFIG) {
      state = MQTT_CLIENT_STATE_DISCONNECTED;
      process_poll(&mqtt_client_process);
    }
    break;
  }
  case MQTT_EVENT_PUBLISH: {
    msg_ptr = data;

    /* Implement first_flag in publish message? */
    if(msg_ptr->first_chunk) {
      msg_ptr->first_chunk = 0;
      DBG("APP - Application received a publish on topic '%s'. Payload "
          "size is %i bytes. Content:\n\n",
          msg_ptr->topic, msg_ptr->payload_length);
    }

    pub_handler(msg_ptr->topic, strlen(msg_ptr->topic), msg_ptr->payload_chunk,
                msg_ptr->payload_length);
    break;
  }
  case MQTT_EVENT_SUBACK: {
    DBG("APP - Application is subscribed to topic successfully\n");
    break;
  }
  case MQTT_EVENT_UNSUBACK: {
    DBG("APP - Application is unsubscribed to topic successfully\n");
    break;
  }
  case MQTT_EVENT_PUBACK: {
    DBG("APP - Publishing complete.\n");
    break;
  }
  default:
    DBG("APP - Application got a unhandled MQTT event: %i\n", event);
    break;
  }
}
/*---------------------------------------------------------------------------*/
static int
construct_pub_topic(void)
{
  int len = snprintf(pub_topic, BUFFER_SIZE, "iot-2/evt/%s/fmt/json",
                     conf->event_type_id);

  /* len < 0: Error. Len >= BUFFER_SIZE: Buffer too small */
  if(len < 0 || len >= BUFFER_SIZE) {
    printf("Pub Topic: %d, Buffer %d\n", len, BUFFER_SIZE);
    return 0;
  }

  return 1;
}
/*---------------------------------------------------------------------------*/
static int
construct_sub_topic(void)
{
  int len = snprintf(sub_topic, BUFFER_SIZE, "iot-2/cmd/%s/+/fmt/json",
                     conf->cmd_type);

  /* len < 0: Error. Len >= BUFFER_SIZE: Buffer too small */
  if(len < 0 || len >= BUFFER_SIZE) {
    printf("Sub Topic: %d, Buffer %d\n", len, BUFFER_SIZE);
    return 0;
  }

  return 1;
}
/*---------------------------------------------------------------------------*/
static int
construct_client_id(void)
{
  int len = snprintf(client_id, BUFFER_SIZE, "d:%s:%s:%02x%02x%02x%02x%02x%02x",
                     conf->org_id, conf->type_id,
                     linkaddr_node_addr.u8[0], linkaddr_node_addr.u8[1],
                     linkaddr_node_addr.u8[2], linkaddr_node_addr.u8[5],
                     linkaddr_node_addr.u8[6], linkaddr_node_addr.u8[7]);

  /* len < 0: Error. Len >= BUFFER_SIZE: Buffer too small */
  if(len < 0 || len >= BUFFER_SIZE) {
    printf("Client ID: %d, Buffer %d\n", len, BUFFER_SIZE);
    return 0;
  }

  return 1;
}
/*---------------------------------------------------------------------------*/
static void
update_config(void)
{
  if(construct_client_id() == 0) {
    /* Fatal error. Client ID larger than the buffer */
    state = MQTT_CLIENT_STATE_CONFIG_ERROR;
    return;
  }

  if(construct_sub_topic() == 0) {
    /* Fatal error. Topic larger than the buffer */
    state = MQTT_CLIENT_STATE_CONFIG_ERROR;
    return;
  }

  if(construct_pub_topic() == 0) {
    /* Fatal error. Topic larger than the buffer */
    state = MQTT_CLIENT_STATE_CONFIG_ERROR;
    return;
  }

  /* Reset the counter */
  seq_nr_value = 0;

  state = MQTT_CLIENT_STATE_INIT;

  /*
   * Schedule next timer event ASAP
   *
   * If we entered an error state then we won't do anything when it fires.
   *
   * Since the error at this stage is a config error, we will only exit this
   * error state if we get a new config.
   */
  etimer_set(&publish_periodic_timer, 0);

  return;
}
/*---------------------------------------------------------------------------*/
static int
init_config()
{
  /* Populate configuration with default values */
  memset(conf, 0, sizeof(mqtt_client_config_t));

